fustyles/Arduino/ESP32-CAM_Car/ESP32-CAM_CAR_2pwm_Joystick/app_httpd.cpp
        <script>
          function noStopControl() {
            if (!document.getElementById('nostop').checked) {
              try{
                fetch(document.location.origin+'/control?var=car&val=3');
              }
              catch(e){}
            }
          }
        </script> 
        <script type="text/javascript">
          var joy3Param = { "title": "joystick3" };
          var Joy3 = new JoyStick('joy3Div', joy3Param);
          var carState = "";
          
          setInterval(function(){ 
            if (Joy3.GetDir()=="N"&&carState!="N") {
              carState="N";
              fetch(document.location.origin+'/control?var=car&val=1');
            }
            else if (Joy3.GetDir()=="S"&&carState!="S") {
              carState="S";
              fetch(document.location.origin+'/control?var=car&val=5');
            }
            else if (Joy3.GetDir()=="W"&&carState!="W") {
              carState="W";
              fetch(document.location.origin+'/control?var=car&val=2');
            }
            else if (Joy3.GetDir()=="E"&&carState!="E") {
              carState="E";
              fetch(document.location.origin+'/control?var=car&val=4');
            }
            else if (Joy3.GetDir()=="NW"&&carState!="NW") {
              carState="NW";
              fetch(document.location.origin+'/control?var=car&val=6');
            }
            else if (Joy3.GetDir()=="NE"&&carState!="NE") {
              carState="NE";
              fetch(document.location.origin+'/control?var=car&val=7');
            }
            else if (Joy3.GetDir()=="SW"&&carState!="SW") {
              carState="SW";
              fetch(document.location.origin+'/control?var=car&val=8');
            }
            else if (Joy3.GetDir()=="SE"&&carState!="SE") {
              carState="SE";
              fetch(document.location.origin+'/control?var=car&val=9');
            }
            else if (Joy3.GetDir()=="C"&&carState!="C") {
              carState="C";
              fetch(document.location.origin+'/control?var=car&val=3');
            }
          }, 250);
        </script>       
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
    httpd_resp_set_type(req, "text/html");
    //httpd_resp_set_hdr(req, "Content-Encoding", "gzip");
    //return httpd_resp_send(req, (const char *)index_html_gz, index_html_gz_len);
    return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

void startCameraServer(){
    httpd_config_t config = HTTPD_DEFAULT_CONFIG();

    httpd_uri_t index_uri = {
        .uri       = "/",
        .method    = HTTP_GET,
        .handler   = index_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t status_uri = {
        .uri       = "/status",
        .method    = HTTP_GET,
        .handler   = status_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t cmd_uri = {
        .uri       = "/control",
        .method    = HTTP_GET,
        .handler   = cmd_handler,
        .user_ctx  = NULL
    };

    httpd_uri_t capture_uri = {
        .uri       = "/capture",
        .method    = HTTP_GET,
        .handler   = capture_handler,
        .user_ctx  = NULL
    };

   httpd_uri_t stream_uri = {
        .uri       = "/stream",
        .method    = HTTP_GET,
        .handler   = stream_handler,
        .user_ctx  = NULL
    };


    ra_filter_init(&ra_filter, 20);
    
    mtmn_config.min_face = 80;
    mtmn_config.pyramid = 0.7;
    mtmn_config.p_threshold.score = 0.6;
    mtmn_config.p_threshold.nms = 0.7;
    mtmn_config.r_threshold.score = 0.7;
    mtmn_config.r_threshold.nms = 0.7;
    mtmn_config.r_threshold.candidate_number = 4;
    mtmn_config.o_threshold.score = 0.7;
    mtmn_config.o_threshold.nms = 0.4;
    mtmn_config.o_threshold.candidate_number = 1;
    
    face_id_init(&id_list, FACE_ID_SAVE_NUMBER, ENROLL_CONFIRM_TIMES);
    
    Serial.printf("Starting web server on port: '%d'\n", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(camera_httpd, &index_uri);
        httpd_register_uri_handler(camera_httpd, &cmd_uri);
        httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK) {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
